/*
    ————————————————————————————排序算法分类————————————————————————————
    比较类排序：
        简单排序
            冒泡排序
            选择排序
        插入排序
            插入排序
            希尔排序
        递归排序
            归并排序
            快速排序
            堆排序
    非比较类排序
            计时排序
            桶排序
            基数排序
    ————————————————————————————算法复杂度————————————————————————————
    排序算法	    平均时间复杂度	    最差时间复杂度	    空间复杂度	数据对象稳定性
    冒泡排序	    O(n2)	        O(n2)	        O(1)	    稳定
    选择排序	    O(n2)	        O(n2)	        O(1)	    数组不稳定、链表稳定
    插入排序	    O(n2)	        O(n2)	        O(1)	    稳定
    快速排序	    O(n*log2n)	    O(n2)	        O(log2n)	不稳定
    堆排序	    O(n*log2n)	    O(n*log2n)	    O(1)	    不稳定
    归并排序	    O(n*log2n)	    O(n*log2n)	    O(n)    	稳定
    希尔排序	    O(n*log2n)	    O(n2)	        O(1)    	不稳定
    计数排序	    O(n+m)	        O(n+m)	        O(n+m)	    稳定
    桶排序	    O(n)	        O(n)	        O(m)	    稳定
    基数排序	    O(k*n)	        O(n2)                       稳定
 * */


